SvnBridgeLibrary/Infrastructure/SetWorkItemStatusToFixedMessage.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Header>
		<RequestHeader xmlns="http://schemas.microsoft.com/TeamFoundation/2005/06/WorkItemTracking/ClientServices/03">
			<Id>uuid:{Guid}</Id>
		</RequestHeader>
	</soap:Header>
	<soap:Body>
		<Update xmlns="http://schemas.microsoft.com/TeamFoundation/2005/06/WorkItemTracking/ClientServices/03">
			<package>
				<Package Product="{ServerUrl}/WorkItemTracking/v1.0/ClientService.asmx" xmlns="">
					<UpdateWorkItem WorkItemID="{WorkItemId}" Revision="{RevisionId}" ObjectType="WorkItem">
						<ComputedColumns>
							<ComputedColumn Column="System.RevisedDate" />
							<ComputedColumn Column="System.ChangedDate" />
							<ComputedColumn Column="System.PersonId" />
							<ComputedColumn Column="Microsoft.VSTS.Common.StateChangeDate" />
							<ComputedColumn Column="CodePlex.UpdatedBy" />
						</ComputedColumns>
						<Columns>
							<Column Column="System.State">
								<Value>Fixed</Value>
							</Column>
							<Column Column="System.Reason">
								<Value>Fixed</Value>
							</Column>
							<Column Column="Microsoft.VSTS.Common.StateChangeDate" Type="ServerDateTime">
								<Value />
							</Column>
							<Column Column="CodePlex.UpdatedBy">
								<Value>{UserName}</Value>
							</Column>
						</Columns>
					</UpdateWorkItem>
				</Package>
			</package>
			<metadataHave>
				<MetadataTableHaveEntry>
					<TableName>Hierarchy</TableName>
					<RowVersion>15843</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>Fields</TableName>
					<RowVersion>4884</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>HierarchyProperties</TableName>
					<RowVersion>15884</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>Constants</TableName>
					<RowVersion>16420</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>Rules</TableName>
					<RowVersion>16206</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>ConstantSets</TableName>
					<RowVersion>16425</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>FieldUsages</TableName>
					<RowVersion>4885</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>WorkItemTypes</TableName>
					<RowVersion>15886</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>WorkItemTypeUsages</TableName>
					<RowVersion>15898</RowVersion>
				</MetadataTableHaveEntry>
				<MetadataTableHaveEntry>
					<TableName>Actions</TableName>
					<RowVersion>15901</RowVersion>
				</MetadataTableHaveEntry>
			</metadataHave>
		</Update>
	</soap:Body>
</soap:Envelope>